---
kind: method
id: M:Autodesk.Revit.UI.Macros.UIMacroManager.GetMacroManager(Autodesk.Revit.UI.UIDocument)
source: html/7a55af31-3133-819a-96bd-5f3076efdd8c.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.GetMacroManager Method

Gets the UI Macro manager from the UI document.

## Syntax (C#)
```csharp
public static UIMacroManager GetMacroManager(
	UIDocument document
)
```

## Parameters
- **document** (`Autodesk.Revit.UI.UIDocument`) - The UI document.

## Returns
The new UI Macro manager object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was NULL